[
    {
        "name": "Mercedes-Benz A-Class Limousine",
        "description": "Mercedes-Benz A-Class Limousine price in India starts from ₹ 45.80 Lakh. A-Class Limousine is available in 4 colours - Cosmos Black Mountain Grey Polar White and Iridium Silver. Mercedes-Benz A-Class Limousine seating capacity is 5 People. Mercedes-Benz A-Class Limousine mileage is 17.5 km/l. Mercedes-Benz A-Class Limousine has received 5 Star (Euro NCAP) safety rating.Mercedes-Benz A-Class Limousine car is available in 2 versions and 2 fuel options - petrol and diesel. Mercedes-Benz A-Class Limousine petrol models comes with 1332cc engine which generates a peak power of 161 bhp @ 5500 rpm .The new Mercedes A-Class Limousine a Sedan from Mercedes-Benz was launched in India in May 2023. A-Class Limousine has received a 88% rating score from our users. A-Class Limousine is preferred for its styling and comfort.
        Mercedes-Benz A-Class Limousine competes with BMW 2 Series Gran Coupe Audi A4 and Mercedes-Benz C-Class in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/149525/a-class-limousine-exterior-right-front-three-quarter-2.jpeg?isig=0&q=80",
        "price": 470000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (DCT), Automatic (TC)",
        "engineSize": "1332",
        "mileage": "17.5km/l",
        "safetyRating": "5 Star",
        "averageWaitingPeriod": "9 - 70 weeks",
        "warranty": "8 years",
        "seatingCapacity": "5 People",
        "size": "4558 mm L X 1796 mm W X 1429 mm H",
        "fuelTank": "43 litre"
    },
    {
        "name": "Mercedes-Benz GLA",
        "description": "Mercedes-Benz GLA price in India starts from ₹ 48.46 Lakh. GLA is available in 5 colours  Mountain Grey Metallic Iridium Silver Metallic Cosmos Black Metallic Denim Blue Metallic and Polar White. Mercedes-Benz GLA seating capacity is 5 People. Mercedes-Benz GLA mileage is 17.4 - 20.8 km/l. Mercedes-Benz GLA has received Not Tested safety rating.
        Mercedes-Benz GLA car is available in 3 versions and 2 fuel options - petrol and diesel. Mercedes-Benz GLA petrol models comes with 1332cc engine which generates a peak power of 161 bhp @ 5500 rpm .
        The new Mercedes GLA a SUV from Mercedes-Benz was launched in India in May 2021. GLA has received a 90% rating score from our users. GLA is preferred for its styling and comfort.
        Mercedes-Benz GLA competes with BMW X1 Audi Q3 and Volvo XC40 in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/44784/gla-exterior-left-front-three-quarter.jpeg?isig=0&q=80",
        "price": 520000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (DCT)",
        "engineSize": "1332 cc, 1950 cc",
        "mileage": "17.4 - 20.8 km/l",
        "safetyRating": "Not Tested",
        "averageWaitingPeriod": "3 - 70 Weeks",
        "warranty": "8 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4410 mm L X 2020 mm W X 1611 mm H",
        "fuelTank": "43 litre"
    },
    {
        "name": "Mercedes-Benz AMG A35",
        "description": "Mercedes-Benz amg-a35 price in India starts from ₹ 58.00 Lakh. amg-a35 is available in 6 colours - Denim Blue, Cosmos Black, Mojave Silver, Iridium Silver, Mountain Grey, and Polar White. Mercedes-Benz amg-a35 seating capacity is 5 People. Mercedes-Benz amg-a35 mileage is 13.3 km/l. Mercedes-Benz amg-a35 has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz amg-a35 car is available in 1 versions and 1 fuel options - petrol. Mercedes-Benz amg-a35 petrol models comes with 1991cc engine which generates a peak power of 301 bhp @ 5800 rpm .
        The new Mercedes amg-a35, a Sedan from Mercedes-Benz, was launched in India in Mar 2021. amg-a35 has received a 95% rating score from our users. amg-a35 is preferred for its performance and styling.
         Mercedes-Benz amg-a35 competes with Mercedes-Benz C-Class, Mercedes-Benz AMG GLA35 and BMW 3 Series Gran Limousine in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/109163/amg-a35-right-front-three-quarter-2.jpeg?isig=0&q=80",
        "price": 580000,
        "fuelType": "Petrol",
        "transmission": "Automatic (DCT)",
        "engineSize": "1991 cc",
        "mileage": "13.3 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "3 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4559 mm L X 1992 mm W X 1411 mm H",
        "fuelTank": "51 litre"
    },
    {
        "name": "Mercedes-Benz C-Class",
        "description": "Mercedes-Benz C-Class price in India starts from ₹ 59.99 Lakh. C-Class is available in 6 colours - Obsidian Black, Mojave Silver, Selenite Grey Metallic, Hi-Tech Silver, Cavansite Blue Metallic, and Manufaktur Opalite White Bright. Mercedes-Benz C-Class seating capacity is 5 People. Mercedes-Benz C-Class has received Not Tested safety rating.
            Mercedes-Benz C-Class car is available in 3 versions and 2 fuel options - petrol and diesel. Mercedes-Benz C-Class petrol models comes with 1496cc engine which generates a peak power of 201 bhp @ 5800 rpm .
            The new Mercedes C-Class, a Sedan from Mercedes-Benz, was launched in India in May 2022. C-Class has received a 82% rating score from our users. C-Class is preferred for its styling and comfort.
             Mercedes-Benz C-Class competes with BMW 3 Series Gran Limousine, Mercedes-Benz E-Class and Audi A6 in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/116209/new-c-class-right-front-three-quarter-2.jpeg?isig=0&q=80",
        "price": 690000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (TC)",
        "engineSize": "1496 cc, 1993 cc",
        "mileage": "11 - 14 km/l",
        "safetyRating": "Not Tested",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "3 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4751 mm L X 1820 mm W X 1437 mm H ",
        "fuelTank": "66 litre"
    },
    {
        "name": "Mercedes-Benz AMG GLA35",
        "description": "Mercedes-Benz AMG GLA35 price in India starts from ₹ 63.45 Lakh. AMG GLA35 is available in 6 colours - Cosmos Black, Mountain Grey, Denim Blue, Iridium Silver, Designo Patagonia Red, and Polar White. Mercedes-Benz AMG GLA35 seating capacity is 5 People. Mercedes-Benz AMG GLA35 mileage is 13.4 km/l. Mercedes-Benz AMG GLA35 has received Not Tested safety rating.
         Mercedes-Benz AMG GLA35 car is available in 1 versions and 1 fuel options - petrol. Mercedes-Benz AMG GLA35 petrol models comes with 1991cc engine which generates a peak power of 302 bhp @ 5800 rpm .
         The new Mercedes AMG GLA35, a SUV from Mercedes-Benz, was launched in India in May 2021. AMG GLA35 has received a 100% rating score from our users. AMG GLA35 is preferred for its performance and styling.
        Mercedes-Benz AMG GLA35 competes with Mercedes-Benz GLA, Mercedes-Benz AMG A35 and Audi Q5 in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/94279/amg-gla35-exterior-left-front-three-quarter-2.jpeg?q=80",
        "price": 640000,
        "fuelType": "Petrol",
        "transmission": "Automatic (DCT)",
        "engineSize": "1991 cc",
        "mileage": "13.4 km/l",
        "safetyRating": "Not Tested",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "3 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4436 mm L X 2020 mm W X 1588 mm H",
        "fuelTank": "51 litre"
    },
    {
        "name": "Mercedes-Benz GLB",
        "description": "Mercedes-Benz GLB price in India starts from ₹ 63.80 Lakh. GLB is available in 5 colours - Polar White, Cosmos Black, Denim Blue, Mountain Grey, and Patagonia Red. Mercedes-Benz GLB seating capacity is 7 People. Mercedes-Benz GLB has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz GLB car is available in 3 versions and 2 fuel options - petrol and diesel. Mercedes-Benz GLB petrol models comes with 1332cc engine which generates a peak power of 160 bhp @ 5500 rpm .
        The new Mercedes GLB, a SUV from Mercedes-Benz, was launched in India in Dec 2022. GLB has received a 95% rating score from our users. GLB is preferred for its styling and comfort.
        Mercedes-Benz GLB competes with Mercedes-Benz GLC, BMW X3 and Land Rover Discovery Sport in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/134364/glb-right-front-three-quarter-2.jpeg?isig=0&q=80",
        "price": 690000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (DCT)",
        "engineSize": "1332 cc, 1950 cc",
        "mileage": "13.4 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "8 - 70 Weeks",
        "warranty": "8 Years (Unlimited KMs)",
        "seatingCapacity": "7 People",
        "size": "4634 mm L X 1834 mm W X 1697 mm H",
        "fuelTank": "52L, 60L"
    },
    {
        "name": "Mercedes-Benz GLC",
        "description": "Mercedes-Benz GLC price in India starts from ₹ 73.50 Lakh. GLC 2023 is available in 5 colours - Nautic Blue, Mojave Silver, Selenite Grey, Polar White, and Obsidian Black. Mercedes-Benz GLC seating capacity is 5 People. Mercedes-Benz GLC mileage is 14.72 - 19.47 km/l. Mercedes-Benz GLC 2023 has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz GLC car is available in 2 versions and 2 fuel options - petrol and diesel. Mercedes-Benz GLC petrol models comes with 1999cc engine which generates a peak power of 255 bhp .
        The new GLC, a SUV from Mercedes, was launched in India in Aug 2023. GLC has received a 97% rating score from our users.
         Mercedes-Benz GLC competes with BMW X3, Audi Q5 and Mercedes-Benz GLE in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/150751/glc-right-front-three-quarter-2.jpeg?isig=0&q=80",
        "price": 740000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (TC)",
        "engineSize": "1999 cc, 1993 cc",
        "mileage": "14.72 - 19.47 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "2 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4716 mm L X 1890 mm W X 1640 mm H",
        "fuelTank": "0"
    },
    {
        "name": "Mercedes-Benz EQB",
        "description": "Mercedes-Benz EQB price in India starts from ₹ 74.50 Lakh. EQB is available in 5 colours - Cosmos Black, Rose Gold, Digital White, Mountain Grey, and Iridium Silver. Mercedes-Benz EQB seating capacity is 7 People. Mercedes-Benz EQB has received 5 Star (Euro NCAP) star NCAP Rating safety rating.
        Mercedes-Benz EQB car is available in 2 versions and 1 fuel options - electric.
        The new Mercedes EQB, a SUV from Mercedes-Benz, was launched in India in Dec 2022. EQB has received a 100% rating score from our users.
        Mercedes-Benz EQB competes with BMW i4, Mercedes-Benz EQC and Mercedes-Benz GLC in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/108503/right-front-three-quarter.jpeg?isig=0&q=80",
        "price": 770000,
        "fuelType": "Electric",
        "transmission": "No",
        "engineSize": "",
        "mileage": "423 km",
        "safetyRating": "5 Star (Euro NCAP) star NCAP Rating",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "5 Years (Unlimited KMs)",
        "seatingCapacity": "7 People",
        "size": "4684 mm L X 1834 mm W X 1701 mm H",
        "fuelTank": "0"
    },
    {
        "name": "Mercedes-Benz E-Class",
        "description": "Mercedes-Benz E-Class price in India starts from ₹ 74.95 Lakh. E-Class is available in 6 colours - Designo Hyacinth Red, Polar White, Obsidian Black, High Tech Silver, Mojave Silver, and Selenite Grey. Mercedes-Benz E-Class seating capacity is 5 People. Mercedes-Benz E-Class has received 5 Star (Euro NCAP) safety rating.
      Mercedes-Benz E-Class car is available in 3 versions and 2 fuel options - petrol and diesel. Mercedes-Benz E-Class petrol models comes with 1991cc engine which generates a peak power of 194 bhp @ 5500 rpm .
        The new Mercedes E-Class, a Sedan from Mercedes-Benz, was launched in India in Mar 2021. E-Class has received a 92% rating score from our users. E-Class is preferred for its styling and comfort.
       Mercedes-Benz E-Class competes with BMW 5 Series, Mercedes-Benz C-Class and BMW 6 Series GT in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/47336/e-class-exterior-left-front-three-quarter.jpeg?q=80",
        "price": 880000,
        "fuelType": "Petrol, Diesel",
        "transmission": "Automatic (TC)",
        "engineSize": "1991 cc, 1950 cc, 2925 cc",
        "mileage": "10 - 16 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "3 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "5075 mm L X 1860 mm W X 1495 mm H",
        "fuelTank": "80 litre "
    },
    {
        "name": "Mercedes-Benz AMG GLC43 Coupe",
        "description": "Mercedes-Benz AMG GLC43 Coupe price in India starts from ₹ 86.99 Lakh. AMG GLC43 Coupe is available in 6 colours - Obsidian Black, Brilliant Blue, Graphite Grey, Polar White, Designo Hyacinth Red, and Designo Salenite Grey Magno. Mercedes-Benz AMG GLC43 Coupe seating capacity is 5 People. Mercedes-Benz AMG GLC43 Coupe mileage is 9.5 km/l. Mercedes-Benz AMG GLC43 Coupe has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz AMG GLC43 Coupe car is available in 1 versions and 1 fuel options - petrol. Mercedes-Benz AMG GLC43 Coupe petrol models comes with 2996cc engine which generates a peak power of 385 bhp @ 5500 rpm .
       The new Mercedes AMG GLC43 Coupe, a Coupe from Mercedes-Benz, was launched in India in Nov 2020. AMG GLC43 Coupe has received a 97% rating score from our users. AMG GLC43 Coupe is preferred for its styling and comfort.
      Mercedes-Benz AMG GLC43 Coupe competes with Mercedes-Benz GLC Coupe, BMW X3 M40i and Mercedes-Benz E-Class in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/50924/amg-glc-43-coupe-exterior-left-front-three-quarter.jpeg?q=80",
        "price": 870000,
        "fuelType": "Petrol",
        "transmission": "Automatic (TC)",
        "engineSize": "2996 cc",
        "mileage": "9.5 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "2 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4749 mm L X 2096 mm W X 1585 mm H",
        "fuelTank": "66 litre "
    },
    {
        "name": "Mercedes-Benz GLE",
        "description": "Mercedes-Benz GLE price in India starts from ₹ 89.87 Lakh. GLE is available in 6 colours - Cavansite Blue Metallic, Designo Hyacinth Red Metallic, Mojave Silver Metallic, Obsidian Black Metallic, Polar White, and Selenite Grey Metallic. Mercedes-Benz GLE seating capacity is 5 People. Mercedes-Benz GLE mileage is 11.11 - 14 km/l. Mercedes-Benz GLE has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz GLE car is available in 3 versions and 2 fuel options - diesel and petrol. Mercedes-Benz GLE diesel models comes with 1950cc engine which generates a peak power of 241 bhp @ 4200 rpm . Mercedes-Benz GLE is also offered in 2925cc diesel engine which generates a peak power of 326 bhp @ 3600 rpm .
         The new Mercedes GLE, a SUV from Mercedes-Benz, was launched in India in Jan 2020. GLE has received a 92% rating score from our users. GLE is preferred for its styling and comfort.
         Mercedes-Benz GLE competes with BMW X5, Land Rover Range Rover Velar and Mercedes-Benz GLC in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/36137/mercedesbenz-gle-exterior8.jpeg?q=80",
        "price": 1080000,
        "fuelType": "Diesel, Petrol",
        "transmission": "Automatic (TC)",
        "engineSize": "1950 cc, 2999 cc, 2925 cc",
        "mileage": "11.11 - 14 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "9 - 70 Weeks",
        "warranty": "2 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4924 mm L X 2157 mm W X 1772 mm H",
        "fuelTank": "93 litre "
    },
    {
        "name": "Mercedes-Benz AMG A45 S",
        "description": "Mercedes-Benz GLE price in India starts from ₹ 89.87 Lakh. GLE is available in 6 colours - Cavansite Blue Metallic, Designo Hyacinth Red Metallic, Mojave Silver Metallic, Obsidian Black Metallic, Polar White, and Selenite Grey Metallic. Mercedes-Benz GLE seating capacity is 5 People. Mercedes-Benz GLE mileage is 11.11 - 14 km/l. Mercedes-Benz GLE has received 5 Star (Euro NCAP) safety rating.
         Mercedes-Benz GLE car is available in 3 versions and 2 fuel options - diesel and petrol. Mercedes-Benz GLE diesel models comes with 1950cc engine which generates a peak power of 241 bhp @ 4200 rpm . Mercedes-Benz GLE is also offered in 2925cc diesel engine which generates a peak power of 326 bhp @ 3600 rpm .
         The new Mercedes GLE, a SUV from Mercedes-Benz, was launched in India in Jan 2020. GLE has received a 92% rating score from our users. GLE is preferred for its styling and comfort.
         Mercedes-Benz GLE competes with BMW X5, Land Rover Range Rover Velar and Mercedes-Benz GLC in India.",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/36137/mercedesbenz-gle-exterior8.jpeg?q=80",
        "price": 920000,
        "fuelType": "Petrol",
        "transmission": "Automatic (DCTC)",
        "engineSize": "1991 cc",
        "mileage": "12 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "3 - 70 Weeks",
        "warranty": "3 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4445 mm L X 1850 mm W X 1412 mm H",
        "fuelTank": "51 litre "
    },
    {
        "name": "Mercedes-Benz EQC",
        "description": "Mercedes-Benz EQC price in India starts from ₹ 99.51 Lakh. EQC is available in 3 colours - Polar White, High-Tech Silver, and Graphite Grey. Mercedes-Benz EQC seating capacity is 5 People. Mercedes-Benz EQC has received 5 Star (Euro NCAP) star NCAP Rating safety rating.
          Mercedes-Benz EQC car is available in 1 versions and 1 fuel options - electric.
         The new Mercedes EQC, a SUV from Mercedes-Benz, was launched in India in Oct 2020. EQC has received a 90% rating score from our users. EQC is preferred for its styling and comfort.
         Mercedes-Benz EQC competes with Mercedes-Benz EQB, Volvo XC90 and BMW iX in India",
        "img": "https://imgd-ct.aeplcdn.com/664x415/n/cw/ec/44579/eqc-exterior-left-front-three-quarter.jpeg?q=80",
        "price": 990000,
        "fuelType": "Electric",
        "transmission": "",
        "engineSize": "450 km",
        "mileage": "12 km/l",
        "safetyRating": "5 Star (Euro NCAP)",
        "averageWaitingPeriod": "3 - 70 Weeks",
        "warranty": "8 Years (Unlimited KMs)",
        "seatingCapacity": "5 People",
        "size": "4762 mm L X 1884 mm W X 1624 mm H",
        "fuelTank": ""
    }
]